cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?>

<!-- ********************************************************************** -->
<!-- ******  ADuCM302x.svd                                                  -->
<!-- ********************************************************************** -->
<!--                                                                        -->
<!-- Date         :   Jul 13, 2017                                          -->
<!--                                                                        -->
<!-- ARM CMSIS-SVD (System View Description) Schema Version 1.1             -->
<!-- Provides for device-specific debugging views of peripherals            -->
<!--                                                                        -->
<!-- Copyright (c) 2014-2017 Analog Devices, Inc.  All Rights Reserved.     -->
<!-- This software is proprietary and confidential to Analog Devices, Inc.  -->
<!-- and its licensors.                                                     -->
<!--                                                                        -->
<!-- This file was auto-generated. Do not make local changes to this file!! -->
<!-- Note: Output was post-modified removing default dimIndex lines to avoid WARNING M208 -->
<!--                                                                        -->
<!-- ********************************************************************** -->

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd" >
  <vendor>Analog Devices</vendor>                                       <!-- device vendor name -->
  <vendorID>ADI</vendorID>                                        <!-- device vendor short name -->
  <name>ADuCM302x</name>                                          <!-- name of part-->
  <series>ADuCM302x</series>                                         <!-- device series the device belongs to -->
  <version>1p0</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>ARM Cortex-M3 Microcontroller based device</description>
  <licenseText>                                                   <!-- this license text will appear in header file. 
 force line breaks -->
    ARM Limited (ARM) is supplying this software for use with Cortex-M

    processor based microcontroller, but can be equally used for other

    suitable  processor architectures. This file can be freely distributed.

    Modifications to this file shall be clearly marked.

    

    THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED

    OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF

    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.

    ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR

    CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
  </licenseText>
  <cpu>                                                           <!-- details about the cpu embedded in the device -->
    <name>CM3</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_ADuCM302x</headerSystemFilename>
  <headerDefinitionsPrefix>ADI_</headerDefinitionsPrefix>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <!-- the size of the registers is set to a bit width of 32. This can be overruled for individual peripherals and/or registers -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <!-- the access to all registers is set to be readable and writeable. This can be overruled for individual peripherals and/or registers -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <!-- for demonstration purposes the resetValue for all registers of the device is set to be 0. This can be overruled within the description -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <!-- the resetMask = 0 specifies that by default no register of this device has a defined reset value -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
     <peripherals>
      <peripheral>
         <name>TMR0</name>
         <description>General Purpose Timer</description>
         <baseAddress>0x40000000</baseAddress>
         <groupName>TMR0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>TMR0_EVT</name>
      <value>11</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>LOAD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>16-bit Load Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CURCNT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>16-bit Timer Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Current Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Control</description>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UP</name>
                     <description>Count up</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Timer Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Timer Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RLD</name>
                     <description>Reload Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EVTRANGE</name>
                     <description>Event Select Range</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EVTEN</name>
                     <description>Event Select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RSTEN</name>
                     <description>Counter and Prescale Reset Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SYNCBYP</name>
                     <description>Synchronization Bypass</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRINT</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Clear Interrupt</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Clear Timeout Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EVTCAPT</name>
                     <description>Clear Captured Event Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAPTURE</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Capture</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>16-bit Captured Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALOAD</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>16-bit Load Value, Asynchronous</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Load Value, Asynchronous</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACURCNT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>16-bit Timer Value, Asynchronous</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Timeout Event Occurred</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Capture Event Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Timer Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PDOK</name>
                     <description>Clear Interrupt Register Synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNTRST</name>
                     <description>Counter Reset Occurring</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMCTL</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>PWM Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCH</name>
                     <description>PWM Match Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PWM_TOGGLE</name>
                           <description>PWM in toggle mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWM_MATCH</name>
                           <description>PWM in match mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDLESTATE</name>
                     <description>PWM Idle State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IDLE_LOW</name>
                           <description>PWM idles low</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE_HIGH</name>
                           <description>PWM idles high</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMMATCH</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>PWM Match Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>PWM Match Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
