cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR1</name>
         <baseAddress>0x40000400</baseAddress>
   <interrupt>
      <name>TMR1_EVT</name>
      <value>12</value>
      <description>Event</description>
   </interrupt>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR2</name>
         <baseAddress>0x40000800</baseAddress>
   <interrupt>
      <name>TMR2_EVT</name>
      <value>40</value>
      <description>Event</description>
   </interrupt>
      </peripheral>
      <peripheral>
         <name>RTC0</name>
         <description>Real-Time Clock</description>
         <baseAddress>0x40001000</baseAddress>
         <groupName>RTC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>RTC0_EVT</name>
      <value>8</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>CR0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>RTC Control 0</description>
               <resetValue>0x000003C4</resetValue>
               <fields>
                  <field>
                     <name>CNTEN</name>
                     <description>Global Enable for the RTC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMEN</name>
                     <description>Enable the RTC Alarm (Absolute) Operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMINTEN</name>
                     <description>Enable ALMINT Sourced Alarm Interrupts to the CPU</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRMEN</name>
                     <description>Enable RTC Digital Trimming</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALMEN</name>
                     <description>Enable RTC Modulo-60 Counting of Time Past a Modulo-60 Boundary</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALM</name>
                     <description>Periodic, Modulo-60 Alarm Time in Prescaled RTC Time Units Beyond a Modulo-60 Boundary</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MOD60ALMINTEN</name>
                     <description>Enable Periodic Modulo-60 RTC Alarm  Sourced Interrupts to the CPU</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOINTEN</name>
                     <description>Enable ISOINT Sourced Interrupts to the CPU When Isolation of the RTC Power Domain is Activated and Subsequently De-activated</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDERRINTEN</name>
                     <description>Enable Write Pending Error Sourced Interrupts to the CPU When an RTC Register-write Pending Error Occurs</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCINTEN</name>
                     <description>Enable Write Synchronization Sourced Interrupts to the CPU</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDINTEN</name>
                     <description>Enable Write Pending Sourced Interrupts to the CPU</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR0</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>RTC Status 0</description>
               <resetValue>0x00003F80</resetValue>
               <fields>
                  <field>
                     <name>ALMINT</name>
                     <description>Alarm Interrupt Source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALMINT</name>
                     <description>Modulo-60 RTC Alarm Interrupt Source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOINT</name>
                     <description>RTC Power-Domain Isolation Interrupt Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDERRINT</name>
                     <description>Write Pending Error Interrupt Source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCINT</name>
                     <description>Write Synchronisation Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDINT</name>
                     <description>Write Pending Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCCR0</name>
                     <description>Synchronisation Status of Posted Writes to CR0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSR0</name>
                     <description>Synchronisation Status of Posted Writes to SR0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCNT0</name>
                     <description>Synchronisation Status of Posted Writes to CNT0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCNT1</name>
                     <description>Synchronisation Status of Posted Writes to CNT1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM0</name>
                     <description>Synchronisation Status of Posted Writes to ALM0</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM1</name>
                     <description>Synchronisation Status of Posted Writes to ALM1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCTRM</name>
                     <description>Synchronisation Status of Posted Writes to TRM</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ISOENB</name>
                     <description>Visibility of 32kHz Sourced Registers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR1</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>RTC Status 1</description>
               <resetValue>0x00000078</resetValue>
               <fields>
                  <field>
                     <name>WPNDCR0</name>
                     <description>Pending Status of Posted Writes to CR0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDSR0</name>
                     <description>Pending Status of Posted Clearances of Interrupt Sources in SR0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCNT0</name>
                     <description>Pending Status of Posted Writes to CNT0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCNT1</name>
                     <description>Pending Status of Posted Writes to CNT1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM0</name>
                     <description>Pending Status of Posted Writes to ALM0</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM1</name>
                     <description>Pending Status of Posted Writes to ALM1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDTRM</name>
                     <description>Pending Status of Posted Writes to TRM</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT0</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>RTC Count 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower 16 Prescaled (Non-Fractional) Bits of the RTC Real-Time Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT1</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>RTC Count 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper 16 Prescaled (Non-Fractional) Bits of the RTC Real-Time Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM0</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>RTC Alarm 0</description>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower 16 Prescaled (i.e. Non-Fractional) Bits of the RTC Alarm Target Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM1</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>RTC Alarm 1</description>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper 16 Prescaled (Non-Fractional) Bits of the RTC Alarm Target Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRM</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>RTC Trim</description>
               <resetValue>0x00000398</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Trim Value in Prescaled RTC Time Units to Be Added or Subtracted from the RTC Count at the End of a Periodic Interval Selected by TRM:TRMIVL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Trim Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IVL</name>
                     <description>Trim Interval in Prescaled RTC Time Units</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IVL2EXPMIN</name>
                     <description>Minimum Power-of-two Interval of Prescaled RTC Time Units Which TRM:TRMIVL TRMIVL Can Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GWY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>RTC Gateway</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWKEY</name>
                     <description>Software-keyed Command Issued by the CPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR1</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>RTC Control 1</description>
               <resetValue>0x000001E0</resetValue>
               <fields>
                  <field>
                     <name>CNTINTEN</name>
                     <description>Enable for the RTC Count Interrupt Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PSINTEN</name>
                     <description>Enable for the Prescaled, Modulo-1 Interrupt Source, in SR2:RTCPSINT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRMINTEN</name>
                     <description>Enable for the RTC Trim Interrupt Source, in SR2:RTCTRMINT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLLINTEN</name>
                     <description>Enable for the RTC Count Roll-Over Interrupt Source, in SR2:RTCCNTROLLINT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLLINTEN</name>
                     <description>Enable for the RTC Modulo-60 Count Roll-Over Interrupt Source, in SR2:RTCCNTMOD60ROLLINT   </description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PRESCALE2EXP</name>
                     <description>Prescale Power of 2 Division Factor for the RTC Base Clock</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
