cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>SR2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>RTC Status 2</description>
               <resetValue>0x0000C000</resetValue>
               <fields>
                  <field>
                     <name>CNTINT</name>
                     <description>RTC Count Interrupt Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PSINT</name>
                     <description>RTC Prescaled, Modulo-1 Boundary Interrupt Source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRMINT</name>
                     <description>RTC Trim Interrupt Source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLLINT</name>
                     <description>RTC Count Roll-Over Interrupt Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLLINT</name>
                     <description>RTC Modulo-60 Count Roll-Over Interrupt Source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLL</name>
                     <description>RTC Count Roll-Over</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLL</name>
                     <description>RTC Count Modulo-60 Roll-Over</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRMBDYMIR</name>
                     <description>Mirror of MOD:RTCTRMBDY</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCR1MIR</name>
                     <description>Pending Status of Posted Writes to CR1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM2MIR</name>
                     <description>Pending Status of Posted Writes to ALM2</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR1MIR</name>
                     <description>Synchronization Status of Posted Writes to CR1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM2MIR</name>
                     <description>Synchronization Status of Posted Writes to ALM2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP0</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Constituent Part of the 47-bit Input Capture Channel 0, Containing a Sticky Snapshot of  CNT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP1</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Part of the 47-bit Input Capture Channel 0 Containing a Sticky Snapshot of  CNT1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP2</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Part of the 47-bit Input Capture Channel 0 Containing a Sticky Snapshot of CNT2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>16</size>
               <description>RTC Modulo</description>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>CNTMOD60</name>
                     <description>Modulo-60 Value of the RTC Count: CNT1 and CNT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INCR</name>
                     <description>Most Recent Increment Value Added to the RTC Count in CNT1 and CNT0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRMBDY</name>
                     <description>Trim Boundary Indicator</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT0_4TOZERO</name>
                     <description>Mirror of CNT0[4:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT2</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>RTC Count 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Fractional Bits of the RTC Real-Time Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM2</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>RTC Alarm 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Fractional Bits of the Alarm Target Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR3</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>RTC Status 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC0IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC2IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC3IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC4IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMINTMIR</name>
                     <description>Read-only Mirror of the ALMINT Interrupt Source in SR0 Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS1IRQ</name>
                     <description>Sticky Interrupt Source for SensorStrobe Channel 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2IC</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>16</size>
               <description>RTC Control 2 for Configuring Input Capture Channels</description>
               <resetValue>0x000083A0</resetValue>
               <fields>
                  <field>
                     <name>IC0EN</name>
                     <description>Enable for the RTC Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC2EN</name>
                     <description>Enable for the RTC Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC3EN</name>
                     <description>Enable for the RTC Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC4EN</name>
                     <description>Enable for the RTC Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC0LH</name>
                     <description>Polarity of the Active-Going Capture Edge for the RTC Input Capture Channel 0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC2LH</name>
                     <description>Polarity of the Active-going Capture Edge for the Input Capture Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC3LH</name>
                     <description>Polarity of the Active-going Capture Edge for the Input Capture Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC4LH</name>
                     <description>Polarity of the Active-going Capture Edge for the Input Capture Channel 4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC0IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC2IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC3IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IC4IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ICOWUSEN</name>
                     <description>Enable Overwrite of Unread Snapshots for All Input Capture Channels</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3SS</name>
               <addressOffset>0x00000050</addressOffset>
               <size>16</size>
               <description>RTC Control 3 for Configuring SensorStrobe Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1EN</name>
                     <description>Enable for SensorStrobe Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS1IRQEN</name>
                     <description>Interrupt Enable for SensorStrobe Channel 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR4SS</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>RTC Control 4 for Configuring SensorStrobe Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1MSKEN</name>
                     <description>Enable for Thermometer-Code Masking of the SensorStrobe Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_MSK</name>
                           <description>Do not apply a mask to SensorStrobe Channel 1 Register</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THERM_MSK</name>
                           <description>Apply thermometer decoded mask</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS1ARLEN</name>
                     <description>Enable for Auto-Reloading When SensorStrobe Match Occurs</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSMSK</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>RTC Mask for SensorStrobe Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SSMSK</name>
                     <description>Thermometer-Encoded Masks for SensorStrobe Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1ARL</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload for SensorStrobe Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1ARL</name>
                     <description>Auto-Reload Value When SensorStrobe Match Occurs</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC2</name>
               <addressOffset>0x00000064</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC2</name>
                     <description>RTC Input Capture Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC3</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC3</name>
                     <description>RTC Input Capture Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC4</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 4</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC4</name>
                     <description>RTC Input Capture Channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
