cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>SS1</name>
               <addressOffset>0x00000070</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 1</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1</name>
                     <description>SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR4</name>
               <addressOffset>0x00000080</addressOffset>
               <size>16</size>
               <description>RTC Status 4</description>
               <resetValue>0x000077FF</resetValue>
               <fields>
                  <field>
                     <name>WSYNCSR3</name>
                     <description>Synchronisation Status of Posted Writes to SR3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR2IC</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR3SS</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 3 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR4SS</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 4 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSSMSK</name>
                     <description>Synchronization Status of Posted Writes to Masks for SensorStrobe Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS1ARL</name>
                     <description>Synchronization Status of Posted Writes to RTC Auto-Reload for SensorStrobe Channel 1 Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS1</name>
                     <description>Synchronization Status of Posted Writes to SensorStrobe Channel 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC0</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC2</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC3</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC4</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR5</name>
               <addressOffset>0x00000084</addressOffset>
               <size>16</size>
               <description>RTC Status 5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPENDSR3</name>
                     <description>Pending Status of Posted Clearances of Interrupt Sources in RTC Status 3 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR2IC</name>
                     <description>Pending Status of Posted Writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR3SS</name>
                     <description>Pending Status of Posted Writes to RTC Control 3 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR4SS</name>
                     <description>Pending Status of Posted Writes to RTC Control 4 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSSMSK</name>
                     <description>Pending Status of Posted Writes to RTC Masks for SensorStrobe Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS1ARL</name>
                     <description>Pending Status of Posted Writes to RTC Auto-Reload for SensorStrobe Channel 1 Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS1</name>
                     <description>Pending Status of Posted Writes to SensorStrobe Channel 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC0</name>
                     <description>Pending Status of Posted Reads of Input Capture Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC2</name>
                     <description>Pending Status of Posted Reads of IC2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC3</name>
                     <description>Pending Status of Posted Reads of IC3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC4</name>
                     <description>Pending Status of Posted Reads of IC4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR6</name>
               <addressOffset>0x00000088</addressOffset>
               <size>16</size>
               <description>RTC Status 6</description>
               <resetValue>0x00007900</resetValue>
               <fields>
                  <field>
                     <name>IC0UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC2UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC3UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC4UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC0SNAP</name>
                     <description>Confirmation That RTC Snapshot 0, 1, 2 Registers Reflect the Value of Input-Capture Channel RTC Input Capture Channel 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FRZCNTPTR</name>
                     <description>Pointer for the Triple-Read Sequence of FRZCNT</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1TGT</name>
               <addressOffset>0x0000008C</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 1 Target</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1TGT</name>
                     <description>Current Target Value for the SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRZCNT</name>
               <addressOffset>0x00000090</addressOffset>
               <size>16</size>
               <description>RTC Freeze Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FRZCNT</name>
                     <description>RTC Freeze Count. Coherent, Triple 16-Bit Read of the 47-Bit RTC Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
