cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>TCTL</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>Timing Control Register</description>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>THDATIN</name>
                     <description>Data in Hold Start</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FILTEROFF</name>
                     <description>Input Filter Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASTRETCH_SCL</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>Automatic Stretch SCL</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MST</name>
                     <description>Master Automatic Stretch Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SLV</name>
                     <description>Slave Automatic Stretch Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MSTTMO</name>
                     <description>Master Automatic Stretch Timeout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLVTMO</name>
                     <description>Slave Automatic Stretch Timeout</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SPI0</name>
         <description>Serial Peripheral Interface</description>
         <baseAddress>0x40004000</baseAddress>
         <groupName>SPI0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>SPI0_EVT</name>
      <value>15</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Status</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>SPI Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>SPI Transfer Completion</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>SPI Tx FIFO Empty Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXDONE</name>
                     <description>SPI Tx Done in Read Command Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXUNDR</name>
                     <description>SPI Tx FIFO Underflow</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXIRQ</name>
                     <description>SPI Tx IRQ</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXIRQ</name>
                     <description>SPI Rx IRQ</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>SPI Rx FIFO Overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CS</name>
                     <description>CS Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSERR</name>
                     <description>Detected a CS Error Condition in Slave Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSRISE</name>
                     <description>Detected a Rising Edge on CS, in Slave CON Mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSFALL</name>
                     <description>Detected a Falling Edge on CS, in Slave CON Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Detected an Edge on Ready Indicator for Flow Control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Receive</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BYTE1</name>
                     <description>8-bit Receive Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>8-bit Receive Buffer, Used Only in DMA Modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Transmit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BYTE1</name>
                     <description>8-bit Transmit Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>8-bit Transmit Buffer, Used Only in DMA Modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>SPI Baud Rate Selection</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>SPI Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>SPI Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPIEN</name>
                     <description>SPI Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MASEN</name>
                     <description>Master Mode Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>Serial Clock Phase Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Serial Clock Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WOM</name>
                     <description>SPI Wired-OR Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSB</name>
                     <description>LSB First Transfer Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIM</name>
                     <description>SPI Transfer and Interrupt Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ZEN</name>
                     <description>Transmit Zeros Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXOF</name>
                     <description>Rx Overflow Overwrite Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OEN</name>
                     <description>Slave MISO Output Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Loopback Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CON</name>
                     <description>Continuous Transfer Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RFLUSH</name>
                     <description>SPI Rx FIFO Flush Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TFLUSH</name>
                     <description>SPI Tx FIFO Flush Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CSRST</name>
                     <description>Reset Mode for CS Error Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>SPI Interrupts Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQMODE</name>
                     <description>SPI IRQ Mode Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CS</name>
                     <description>Enable Interrupt on Every CS Edge in Slave CON Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXUNDR</name>
                     <description>Tx Underflow Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>Rx Overflow Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Ready Signal Edge Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXDONE</name>
                     <description>SPI Transmit Done Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>SPI Transfer Completion Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Tx FIFO Empty Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Transfer Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Transfer Byte Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00003FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FRAMECONT</name>
                     <description>Continue Frame</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
