cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SPI0">
         <name>SPI1</name>
         <baseAddress>0x40004400</baseAddress>
   <interrupt>
      <name>SPI1_EVT</name>
      <value>42</value>
      <description>Event</description>
   </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI0">
         <name>SPI2</name>
         <baseAddress>0x40024000</baseAddress>
   <interrupt>
      <name>SPI2_EVT</name>
      <value>16</value>
      <description>Event</description>
   </interrupt>
      </peripheral>
      <peripheral>
         <name>UART0</name>
         <description>Unknown</description>
         <baseAddress>0x40005000</baseAddress>
         <groupName>UART0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>UART_EVT</name>
      <value>14</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>RX</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Receive Buffer Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RBR</name>
                     <description>Receive Buffer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Transmit Holding Register</description>
               <alternateRegister>RX</alternateRegister>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THR</name>
                     <description>Transmit Holding Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERBFI</name>
                     <description>Receive Buffer Full Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ETBEI</name>
                     <description>Transmit Buffer Empty Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ELSI</name>
                     <description>Rx Status Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDSSI</name>
                     <description>Modem Status Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDMAT</name>
                     <description>DMA Requests in Transmit Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDMAR</name>
                     <description>DMA Requests in Receive Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IIR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Interrupt ID</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>NIRQ</name>
                     <description>Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT</name>
                     <description>Interrupt Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STAT_EDSSI</name>
                           <description>Modem status interrupt (Read MSR register to clear)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAT_ETBEI</name>
                           <description>Transmit buffer empty interrupt (Write to Tx register or read IIR register to clear)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAT_ERBFI</name>
                           <description>Receive buffer full interrupt (Read Rx register to clear)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAT_RLSI</name>
                           <description>Receive line status interrupt (Read LSR register to clear)</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STAT_RFTOI</name>
                           <description>Receive FIFO time-out interrupt (Read Rx register to clear)</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FEND</name>
                     <description>FIFO Enabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Line Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WLS</name>
                     <description>Word Length Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Parity Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPS</name>
                     <description>Parity Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SP</name>
                     <description>Stick Parity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PAR_NOTFORCED</name>
                           <description>Parity will not be forced based on Parity Select and Parity Enable bits.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAR_FORCED</name>
                           <description>Parity forced based on Parity Select and Parity Enable bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRK</name>
                     <description>Set Break</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Modem Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTR</name>
                     <description>Data Terminal Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTS</name>
                     <description>Request to Send</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>Output 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OUT2</name>
                     <description>Output 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Loopback Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LSR</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>Line Status</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Overrun Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Parity Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Framing Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BI</name>
                     <description>Break Indicator</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>THRE</name>
                     <description>Transmit Register Empty</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TEMT</name>
                     <description>Transmit and Shift Register Empty Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>Rx FIFO Parity Error/Frame Error/Break Indication</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSR</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Modem Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCTS</name>
                     <description>Delta CTS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DDSR</name>
                     <description>Delta DSR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TERI</name>
                     <description>Trailing Edge RI</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DDCD</name>
                     <description>Delta DCD</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Clear to Send</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Data Set Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Ring Indicator</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Data Carrier Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Scratch Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR</name>
                     <description>Scratch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCR</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>FIFO Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO Enable as to Work in 16550 Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RFCLR</name>
                     <description>Clear Rx FIFO</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TFCLR</name>
                     <description>Clear Tx FIFO</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FDMAMD</name>
                     <description>FIFO DMA Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODE0</name>
                           <description>In DMA mode 0, RX DMA request will be asserted whenever there&#39;s data in RBR or RX FIFO and de-assert whenever RBR or RX FIFO is empty; TX DMA request will be asserted whenever THR or TX FIFO is empty and de-assert whenever data written to.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>in DMA mode 1, RX DMA request will be asserted whenever RX FIFO trig level or time out reached and de-assert thereafter when RX FIFO is empty; TX DMA request will be asserted whenever TX FIFO is empty and de-assert thereafter when TX FIFO is completely filled up full.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFTRIG</name>
                     <description>Rx FIFO Trigger Level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
