cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>FBR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Fractional Baud Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVN</name>
                     <description>Fractional Baud Rate N Divide Bits 0 to 2047</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000007FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DIVM</name>
                     <description>Fractional Baud Rate M Divide Bits 1 to 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FBEN</name>
                     <description>Fractional Baud Rate Generator Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Baud Rate Divider</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Baud Rate Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCR2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>Second Line Control</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>OSR</name>
                     <description>Over Sample Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>UART Control Register</description>
               <resetValue>0x00000100</resetValue>
               <fields>
                  <field>
                     <name>FORCECLK</name>
                     <description>Force UCLK on</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXINV</name>
                     <description>Invert Receiver Line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOTINV_RX</name>
                           <description>Don&#39;t invert receiver line (idling high).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INV_RX</name>
                           <description>Invert receiver line (idling low).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REV</name>
                     <description>UART Revision ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFC</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>RX FIFO Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFC</name>
                     <description>Current Rx FIFO Data Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TFC</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>TX FIFO Byte Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFC</name>
                     <description>Current Tx FIFO Data Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSC</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>16</size>
               <description>RS485 Half-duplex Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OENP</name>
                     <description>SOUT_EN Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OENSP</name>
                     <description>SOUT_EN De-assert Before Full Stop Bit(s)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DISRX</name>
                     <description>Disable Rx When Transmitting</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DISTX</name>
                     <description>Hold off Tx When Receiving</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>Auto Baud Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ABE</name>
                     <description>Auto Baud Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS_AUTOBAUD</name>
                           <description>Disable auto baudrate</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_AUTOBAUD</name>
                           <description>Enable auto baudrate</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DNIEN</name>
                     <description>Enable Done Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS_DONEINT</name>
                           <description>Disable done interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_DONEINT</name>
                           <description>Enable done interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOIEN</name>
                     <description>Enable Time-out Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS_TIMEOUTINT</name>
                           <description>Disable timeout interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_TIMEOUTINT</name>
                           <description>Enable timeout interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Starting Edge Count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEC_EDGE1</name>
                           <description>First edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE2</name>
                           <description>Second edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE3</name>
                           <description>Third edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE4</name>
                           <description>Fourth edge</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE5</name>
                           <description>Fifth edge</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE6</name>
                           <description>Sixth edge</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE7</name>
                           <description>Seventh edge</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_EDGE8</name>
                           <description>Eighth edge</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EEC</name>
                     <description>Ending Edge Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EEC_EDGE1</name>
                           <description>First edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE2</name>
                           <description>Second edge</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE3</name>
                           <description>Third edge</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE4</name>
                           <description>Fourth edge</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE5</name>
                           <description>Fifth edge</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE6</name>
                           <description>Sixth edge</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE7</name>
                           <description>Seventh edge</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE8</name>
                           <description>Eighth edge</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEC_EDGE9</name>
                           <description>Ninth edge</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASRL</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>Auto Baud Status (Low)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Auto Baud Done Successfully</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BRKTO</name>
                     <description>Timed Out Due to Long Time Break Condition</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NSETO</name>
                     <description>Timed Out Due to No Valid Start Edge Found</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NEETO</name>
                     <description>Timed Out Due to No Valid Ending Edge Found</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>CNT[11:0]  Auto Baud Counter Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASRH</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>Auto Baud Status (High)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT[19:12]  Auto Baud Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
