cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>CH6_OUT</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>Conversion Result Channel 6</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result of Channel 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH7_OUT</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>16</size>
               <description>Conversion Result Channel 7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result of Channel 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAT_OUT</name>
               <addressOffset>0x00000050</addressOffset>
               <size>16</size>
               <description>Battery Monitoring Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result of Battery Monitoring</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMP_OUT</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>Temperature Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result of Temperature Measurement 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMP2_OUT</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>Temperature Result 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result of Temperature Measurement 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_OUT</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>16</size>
               <description>DMA Output Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Conversion Result for DMA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM0_LO</name>
               <addressOffset>0x00000060</addressOffset>
               <size>16</size>
               <description>Channel 0 Low Limit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Low Limit for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Low Limit Comparison on Channel 0</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM0_HI</name>
               <addressOffset>0x00000064</addressOffset>
               <size>16</size>
               <description>Channel 0 High Limit</description>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>High Limit for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable High Limit Comparison on Channel 0</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>HYS0</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>Channel 0 Hysteresis</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Hysteresis Value for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MONCYC</name>
                     <description>Number of Conversion Cycles to Monitor Channel 0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Hysteresis for Comparison on Channel 0</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM1_LO</name>
               <addressOffset>0x00000070</addressOffset>
               <size>16</size>
               <description>Channel 1 Low Limit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Low Limit for Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Low Limit Comparison on Channel 1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM1_HI</name>
               <addressOffset>0x00000074</addressOffset>
               <size>16</size>
               <description>Channel 1 High Limit</description>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>High Limit for Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable High Limit Comparison on Channel 1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>HYS1</name>
               <addressOffset>0x00000078</addressOffset>
               <size>16</size>
               <description>Channel 1 Hysteresis</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Hysteresis Value for Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MONCYC</name>
                     <description>Number of Conversion Cycles to Monitor Channel 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Hysteresis for Comparison on Channel 1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM2_LO</name>
               <addressOffset>0x00000080</addressOffset>
               <size>16</size>
               <description>Channel 2 Low Limit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Low Limit for Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Low Limit Comparison on Channel 2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM2_HI</name>
               <addressOffset>0x00000084</addressOffset>
               <size>16</size>
               <description>Channel 2 High Limit</description>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>High Limit for Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable High Limit Comparison on Channel</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>HYS2</name>
               <addressOffset>0x00000088</addressOffset>
               <size>16</size>
               <description>Channel 2 Hysteresis</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Hysteresis Value for Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MONCYC</name>
                     <description>Number of Conversion Cycles to Monitor Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Hysteresis for Comparison on Channel 2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM3_LO</name>
               <addressOffset>0x00000090</addressOffset>
               <size>16</size>
               <description>Channel 3 Low Limit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Low Limit for Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable Low Limit Comparison on Channel 3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM3_HI</name>
               <addressOffset>0x00000094</addressOffset>
               <size>16</size>
               <description>Channel 3 High Limit</description>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>High Limit for Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable High Limit Comparison on Channel 3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
