cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>SRCADDR_SET</name>
               <addressOffset>0x00000810</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Source Address Decrement Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x01FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR_CLR</name>
               <addressOffset>0x00000814</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Source Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x01FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_SET</name>
               <addressOffset>0x00000818</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Destination Address Decrement Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x01FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_CLR</name>
               <addressOffset>0x0000081C</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Destination Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x01FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>REVID</name>
               <addressOffset>0x00000FE0</addressOffset>
               <size>32</size>
               <description>DMA Controller Revision ID</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DMA Controller Revision ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FLCC0</name>
         <description>Flash Controller</description>
         <baseAddress>0x40018000</baseAddress>
         <groupName>FLCC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDBUSY</name>
                     <description>Command Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRCLOSE</name>
                     <description>WRITE Registers are Closed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDCOMP</name>
                     <description>Command Complete</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRALCOMP</name>
                     <description>Write Almost Complete</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDFAIL</name>
                     <description>Provides Information on Command Failures</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLEEPING</name>
                     <description>Flash Array is in Low Power (Sleep) Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCMD</name>
                     <description>ECC Errors Detected During User Issued SIGN Command</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCRDERR</name>
                     <description>ECC IRQ Cause</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OVERLAP</name>
                     <description>Overlapping Command</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SIGNERR</name>
                     <description>Signature Check Failure During Initialization</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Flash Controller Initialization in Progress</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCINFOSIGN</name>
                     <description>ECC Status of Flash Initialization</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCNT</name>
                     <description>ECC Correction Counter</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCICODE</name>
                     <description>ICode AHB Bus Error ECC Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCDCODE</name>
                     <description>DCode AHB Bus Error ECC Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CACHESRAMPERR</name>
                     <description>SRAM Parity Errors in Cache Controller</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Interrupt Enable</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>CMDCMPLT</name>
                     <description>Command Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WRALCMPLT</name>
                     <description>Write Almost Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMDFAIL</name>
                     <description>Command Fail Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ECC_ERROR</name>
                     <description>Control 2-bit ECC Error Events</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NONE_err</name>
                           <description>Do not generate a response to ECC events</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUS_ERR_err</name>
                           <description>Generate Bus Errors in response to ECC events</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRQ_err</name>
                           <description>Generate IRQs in response to ECC events</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Command</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Commands</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>IDLE</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>ABORT</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>Requests flash to enter Sleep mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIGN</name>
                           <description>SIGN</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>WRITE</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLANK_CHECK</name>
                           <description>Checks all of User Space; fails if any bits in user space are cleared</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERASEPAGE</name>
                           <description>ERASEPAGE</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASSERASE</name>
                           <description>MASSERASE</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_ADDR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Write Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key Hole Address</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_DATA0</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Write Lower Data</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower 32 Bits of Key Hole Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_DATA1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Write Upper Data</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper Half of 64-bit Dualword Data to Be Written</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAGE_ADDR0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Lower Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower Address Bits of the Page Address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAGE_ADDR1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>Upper Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper Address Bits of the Page Address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Key</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WR_ABORT_ADDR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Write Abort Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Address Targeted by an Ongoing Write Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRPROT</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Write Protection</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WORD</name>
                     <description>Write Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
