cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FLCC0_CACHE</name>
         <description>Cache Controller</description>
         <baseAddress>0x40018058</baseAddress>
         <groupName>FLCC0_CACHE</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Cache Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ICEN</name>
                     <description>I-Cache Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SETUP</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Cache Setup</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ICEN</name>
                     <description>I-Cache Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Cache Key</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Cache Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>GPIO0</name>
         <description>Unknown</description>
         <baseAddress>0x40020000</baseAddress>
         <groupName>GPIO0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Port Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIN00</name>
                     <description>Pin 0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN01</name>
                     <description>Pin 1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN02</name>
                     <description>Pin 2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN03</name>
                     <description>Pin 3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN04</name>
                     <description>Pin 4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN05</name>
                     <description>Pin 5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN06</name>
                     <description>Pin 6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN07</name>
                     <description>Pin 7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN08</name>
                     <description>Pin 8 Configuration Bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN09</name>
                     <description>Pin 9 Configuration Bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN10</name>
                     <description>Pin 10 Configuration Bits</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN11</name>
                     <description>Pin 11 Configuration Bits</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN12</name>
                     <description>Pin 12 Configuration Bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN13</name>
                     <description>Pin 13 Configuration Bits</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN14</name>
                     <description>Pin 14 Configuration Bits</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN15</name>
                     <description>Pin 15 Configuration Bits</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Port Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Pin Output Drive Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PE</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Port Output Pull-up/Pull-down Enable</description>
               <resetValue>0x000000C0</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Pin Pull Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Port Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Input Path Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IN</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Port Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Registered Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>Port Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Data Out</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SET</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Port Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Set the Output High for the Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Port Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Set the Output Low for the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TGL</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>Port Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Toggle the Output of the Port Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Port Interrupt Polarity</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Interrupt polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IENA</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Port Interrupt A Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Interrupt A enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IENB</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>Port Interrupt B Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Interrupt B enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>Port Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
