cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>CNVT_B</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; CNV Width</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WID</name>
                     <description>SPT_CNVT Signal Width: Half SPORT B</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity of the SPT_CNVT Signal</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNVT2FS</name>
                     <description>SPT_CNVT to FS Duration: Half SPORT B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_B</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; Tx Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Transmit Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_B</name>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; Rx Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Receive Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CRC0</name>
         <description>CRC Accelerator</description>
         <baseAddress>0x40040000</baseAddress>
         <groupName>CRC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>CRC Control</description>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>CRC Peripheral Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CRC_DIS</name>
                           <description>CRC peripheral is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC_EN</name>
                           <description>CRC peripheral is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LSBFIRST</name>
                     <description>LSB First Calculation Order</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MSB_FIRST</name>
                           <description>MSB First CRC calculation is done</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LSB_FIRST</name>
                           <description>LSB First CRC calculation is done</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BITMIRR</name>
                     <description>Bit Mirroring</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BITMIRR_DIS</name>
                           <description>Bit Mirroring is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITMIRR_EN</name>
                           <description>Bit Mirroring is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BYTMIRR</name>
                     <description>Byte Mirroring</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BYTEMIR_DIS</name>
                           <description>Byte Mirroring is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTEMIR_EN</name>
                           <description>Byte Mirroring is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>W16SWP</name>
                     <description>Word16 Swap</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>W16SP_DIS</name>
                           <description>Word16 Swap disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>W16SP_EN</name>
                           <description>Word16 Swap enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RevID</name>
                     <description>Revision ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPDATA</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Input Data Word</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>CRC Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Residue</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Programmable CRC Polynomial</description>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Reduction Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>1</dimIncrement>
               <name>IPBITS[%s]</name>
               <addressOffset>0x00000010</addressOffset>
               <size>8</size>
               <description>Input Data Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BITS</name>
                     <description>Input Data Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPBYTE</name>
               <addressOffset>0x00000010</addressOffset>
               <size>8</size>
               <description>Input Data Byte</description>
               <alternateRegister>IPBITS0</alternateRegister>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BYTE</name>
                     <description>Input Data Byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
