cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RNG0</name>
         <description>Random Number Generator</description>
         <baseAddress>0x40040400</baseAddress>
         <groupName>RNG0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>RNG0_EVT</name>
      <value>44</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>RNG Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>RNG Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable the RNG</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable the RNG</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SINGLE</name>
                     <description>Generate a Single Number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>Buffer Word</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Byte</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>RNG Sample Length Register</description>
               <resetValue>0x00003400</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Reload Value for the Sample Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRESCALE</name>
                     <description>Prescaler for the Sample Counter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>RNG Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RNRDY</name>
                     <description>Random Number Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STUCK</name>
                     <description>Sampled Data Stuck High or Low</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>RNG Data Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value of the CRC Accumulator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUFF</name>
                     <description>Buffer for RNG Data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCCNT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Oscillator Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Oscillator Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>1</dimIncrement>
               <name>OSCDIFF[%s]</name>
               <addressOffset>0x00000014</addressOffset>
               <size>8</size>
               <description>Oscillator Difference</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DELTA</name>
                     <description>Oscillator Count Difference</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
