cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRYPT0</name>
         <description>Register Map for the Crypto Block</description>
         <baseAddress>0x40044000</baseAddress>
         <groupName>CRYPT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000200</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>CRYPT_EVT</name>
      <value>38</value>
      <description>Event</description>
   </interrupt>
         <registers>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Configuration Register</description>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>BLKEN</name>
                     <description>Enable Bit for Crypto Block</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Enable</name>
                           <description>Enable Crypto Block</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Disable</name>
                           <description>Disable Crypto Block</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENCR</name>
                     <description>Encrypt or Decrypt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INDMAEN</name>
                     <description>Enable DMA Channel Request for Input Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DMA_DISABLE_INBUF</name>
                           <description>Disable DMA Requesting for Input Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_ENABLE_INBUF</name>
                           <description>Enable DMA Requesting for Input Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDMAEN</name>
                     <description>Enable DMA Channel Request for Output Buffer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DMA_DISABLE_OUTBUF</name>
                           <description>Disable DMA Requesting for Output Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMA_ENABLE_OUTBUF</name>
                           <description>Enable DMA Requesting for Output Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INFLUSH</name>
                     <description>Input Buffer Flush</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OUTFLUSH</name>
                     <description>Output Buffer Flush</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AES_BYTESWAP</name>
                     <description>Byte Swap 32 Bit AES Input Data</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AESKEYLEN</name>
                     <description>Select Key Length for AES Cipher</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AESKEYLEN128</name>
                           <description>Uses 128-bit long key</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AESKEYLEN256</name>
                           <description>Uses 256-bit long key</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECBEN</name>
                     <description>Enable ECB Mode Operation</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CTREN</name>
                     <description>Enable CTR Mode Operation</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CBCEN</name>
                     <description>Enable CBC Mode Operation</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CCMEN</name>
                     <description>Enable CCM/CCM* Mode Operation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMACEN</name>
                     <description>Enable CMAC Mode Operation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHA256EN</name>
                     <description>Enable SHA-256 Operation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHAINIT</name>
                     <description>Restarts SHA Computation</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RevID</name>
                     <description>Rev ID for Crypto</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATALEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Payload Data Length</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Length of Payload Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000FFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PREFIXLEN</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Authentication Data Length</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Length of Associated Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTEN</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Interrupt Enable Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INRDYEN</name>
                     <description>Enable Input Ready Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OUTRDYEN</name>
                     <description>Enables the Output Ready Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INOVREN</name>
                     <description>Enable Input Overflow Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHADONEN</name>
                     <description>Enable SHA_Done Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Status Register</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INRDY</name>
                     <description>Input Buffer Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OUTRDY</name>
                     <description>Output Data Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INOVR</name>
                     <description>Overflow in the Input Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHADONE</name>
                     <description>SHA Computation Complete</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHABUSY</name>
                     <description>SHA Busy. in Computation</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INWORDS</name>
                     <description>Number of Words in the Input Buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OUTWORDS</name>
                     <description>Number of Words in the Output Buffer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>INBUF</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Input Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Input Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTBUF</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Output Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Output Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE0</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>Nonce Bits [31:0]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 0: Nonce Bits [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE1</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Nonce Bits [63:32]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 1: Nonce Bits [63:32]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE2</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Nonce Bits [95:64]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 2: Nonce Bits [95:64]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE3</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Nonce Bits [127:96]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 3: Nonce Bits [127:96]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
