cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
            <register>
               <name>AESKEY0</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>AES Key Bits [31:0]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [3:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY1</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>AES Key Bits [63:32]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [7:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY2</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>AES Key Bits [95:64]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY3</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>AES Key Bits [127:96]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [15:12]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY4</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>AES Key Bits [159:128]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [19:16]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY5</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>AES Key Bits [191:160]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [23:20]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY6</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>AES Key Bits [223:192]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [27:24]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY7</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>AES Key Bits [255:224]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [31:28]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNTRINIT</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>Counter Initialization Vector</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Counter Initialization Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000FFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH0</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>SHA Bits [31:0]</description>
               <resetValue>0x6A09E667</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH0</name>
                     <description>Word 0: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH1</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size>
               <description>SHA Bits [63:32]</description>
               <resetValue>0xBB67AE85</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH1</name>
                     <description>Word 1: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH2</name>
               <addressOffset>0x00000058</addressOffset>
               <size>32</size>
               <description>SHA Bits [95:64]</description>
               <resetValue>0x3C6EF372</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH2</name>
                     <description>Word 2: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH3</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>32</size>
               <description>SHA Bits [127:96]</description>
               <resetValue>0xA54FF53A</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH3</name>
                     <description>Word 3: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH4</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size>
               <description>SHA Bits [159:128]</description>
               <resetValue>0x510E527F</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH4</name>
                     <description>Word 4: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH5</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size>
               <description>SHA Bits [191:160]</description>
               <resetValue>0x9B05688C</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH5</name>
                     <description>Word 5: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH6</name>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size>
               <description>SHA Bits [223:192]</description>
               <resetValue>0x1F83D9AB</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH6</name>
                     <description>Word 6: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH7</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size>
               <description>SHA Bits [255:224]</description>
               <resetValue>0x5BE0CD19</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH7</name>
                     <description>Word 7: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_LAST_WORD</name>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size>
               <description>SHA Last Word and Valid Bits Information</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>O_Last_Word</name>
                     <description>Last SHA Input Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>O_Bits_Valid</name>
                     <description>Bits Valid in SHA Last Word Input</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCM_NUM_VALID_BYTES</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <description>NUM_VALID_BYTES</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NUM_VALID_BYTES</name>
                     <description>Number of Valid Bytes in CCM Last Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
