cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLKG0_OSC</name>
         <description>Clocking </description>
         <baseAddress>0x4004C100</baseAddress>
         <groupName>CLKG0_OSC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
   <interrupt>
      <name>CLKG_XTAL_OSC_EVT</name>
      <value>41</value>
      <description>Crystal Oscillator Event</description>
   </interrupt>
   <interrupt>
      <name>CLKG_PLL_EVT</name>
      <value>43</value>
      <description>PLL Event</description>
   </interrupt>
         <registers>
            <register>
               <name>KEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Key Protection for CLKG_OSC_CTL</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Oscillator K</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Oscillator Control</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>LFCLKMUX</name>
                     <description>32kHz Clock Select Mux</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFOSCEN</name>
                     <description>High Frequency Internal Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALEN</name>
                     <description>Low Frequency Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALEN</name>
                     <description>High Frequency Crystal Oscillator Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL_BYPASS</name>
                     <description>Low Frequency Crystal Oscillator Bypass</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL_MON_EN</name>
                     <description>LFXTAL Clock Monitor and Clock Fail Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFOSCOK</name>
                     <description>Status of LFOSC Oscillator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFOSCOK</name>
                     <description>Status of HFOSC</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTALOK</name>
                     <description>Status of LFXTAL Oscillator</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFXTALOK</name>
                     <description>Status of HFXTAL Oscillator</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTAL_MON_FAIL_STAT</name>
                     <description>LFXTAL Not Stable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LFXTAL_RUNNING</name>
                           <description>LFXTAL is running fine</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFXTAL_NOTRUNNING</name>
                           <description>LFXTAL is not running</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
