cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM302x.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLKG0_CLK</name>
         <description>Clocking </description>
         <baseAddress>0x4004C300</baseAddress>
         <groupName>CLKG0_CLK</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Miscellaneous Clock Settings</description>
               <resetValue>0x00000078</resetValue>
               <fields>
                  <field>
                     <name>CLKMUX</name>
                     <description>Clock Mux Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CLKOUT</name>
                     <description>GPIO Clock Out Select (for Debug)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RCLKMUX</name>
                     <description>Flash Reference Clock and HP Buck Source Mux</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLIPSEL</name>
                     <description>SPLL Source Select Mux</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALIE</name>
                     <description>Low Frequency Crystal Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALIE</name>
                     <description>High Frequency Crystal Interrupt Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Clock Dividers</description>
               <resetValue>0x00100404</resetValue>
               <fields>
                  <field>
                     <name>HCLKDIVCNT</name>
                     <description>HCLK Divide Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PCLKDIVCNT</name>
                     <description>PCLK Divide Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ACLKDIVCNT</name>
                     <description>ACLK Divide Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL3</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>System PLL</description>
               <resetValue>0x0000691A</resetValue>
               <fields>
                  <field>
                     <name>SPLLNSEL</name>
                     <description>System PLL N Multiplier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SPLLDIV2</name>
                     <description>System PLL Division by 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLEN</name>
                     <description>System PLL Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLIE</name>
                     <description>System PLL Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLMSEL</name>
                     <description>System PLL M Divider</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SPLLMUL2</name>
                     <description>System PLL Multiply by 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL5</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>User Clock Gating Control</description>
               <resetValue>0x0000001F</resetValue>
               <fields>
                  <field>
                     <name>GPTCLK0OFF</name>
                     <description>Timer 0 User Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPTCLK1OFF</name>
                     <description>Timer 1 User Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPTCLK2OFF</name>
                     <description>Timer 2 User Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UCLKI2COFF</name>
                     <description>I2C Clock User Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPIOCLKOFF</name>
                     <description>GPIO Clock Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PERCLKOFF</name>
                     <description>Disables All Clocks Connected to All Peripherals</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PERIPH_CLK_ACT</name>
                           <description>Clocks to all peripherals are active</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERIPH_CLK_OFF</name>
                           <description>Clocks to all peripherals are gated off</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Clocking Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPLL</name>
                     <description>System PLL Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SPLLLK</name>
                     <description>System PLL Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLUNLK</name>
                     <description>System PLL Unlock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL</name>
                     <description>LF Crystal Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTALOK</name>
                     <description>LF Crystal Stable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALNOK</name>
                     <description>LF Crystal Not Stable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTAL</name>
                     <description>HF Crystal Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFXTALOK</name>
                     <description>HF Crystal Stable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALNOK</name>
                     <description>HF Crystal Not Stable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
